# PostgreSQL
> PostgreSQL란, 가장 발전된 오픈소스 객체 관계형 데이터베이스로 비관계형 데이터 유형과 관계형 데이터 유형 모두 지원

## 구조
![image17](https://github.com/user-attachments/assets/72caeffb-3b98-4ec5-8656-d57c1e369640)
- 클라이언트-서버 모델
  - 서버: 하나의 마스터 프로세스가 실행되어 입력을 대기하고, 각 클라이언트 연결마다 별도의 백엔드 프로세스를 포크하여 할당
  - 데이터베이스 파일들 관리, 클라이언트 애플리케이션으로부터 들어오는 연결 수용 및 클라이언트를 대신하여 데이터베이스 액션 수행
  - 다중 프로세스 방식으로 동작
- 공유 메모리 영역 사용
  - 데이터 페이지와 트랜잭션 로그 캐시
  - 프로세스 간 정보 교환
  - 공유 버퍼: 디스크 I/O를 최소화하기 위해 빈번히 접근되는 데이터 페이지를 메모리에 보관하는 버퍼 풀로, 수십~수백 GB 규모의 큰 버퍼를 다수의 프로세스가 동시에 효율적으로 접근 가능
  - WAL 버퍼: 트랜잭션의 변경 내용을 임시로 저장하는 버퍼로, 일정 시점에 해당 내용이 WAL 로그 파일에 기록
  - 클라이언트로부터 요청이 들어오면, 서버는 공유 버퍼에 데이터를 캐싱하고 백그라운드 프로세스를 활용하여 디스크 액세스를 최소화하면서 요청 처리
- 지연 쓰기(Write-Ahead Logging, WAL) 기법
  - 데이터 무결성과 내구성 보장
  - 모든 변경 작업을 실제 데이터 파일에 적용하기 전에 우선 WAL 로그에 기록하며, 해당 WAL 기록이 디스크에 안전하게 쓰여진 후에야 실제 테이블/인덱스 페이지 수정 이루어짐
  - WAL 로그 기반으로 특정 시점으로서의 복구와 백업 진행
- 다중 버전 동시성 제어(Multi-Version Concurrency Control, MVCC)
  - MVCC 하에서 각 트랜잭션은 데이터의 스냅샷을 바라보며 동작하므로 읽기 작업이 쓰기 작업을 블로킹하지 않고 공존할 수 있고, 동시 다중 사용자 환경에서도 일관성과 성능 유지
  - 업데이트 또는 삭제 시 기존 행을 즉시 지우지 않고 숨겨두고(new tuple) 새로운 버전을 기록하는 방식으로 동작

## 주요 기능
- ACID 트랜잭션과 신뢰성: 원자성, 일관성, 격리성, 지속성의 ACID 특성을 완벽히 준수하며, 트랜잭션을 통한 데이터 일관성 보장
- MVCC에 의한 뛰어난 동시성: 동일한 행의 동시 수정 시에만 최소한의 잠금이 걸리고, 그 외에는 읽기 작업이 쓰기 작업을 블로킹하지 않음
- 풍부한 데이터 타입 지원: 기본적인 정수, 문자, 날짜/시간, 불리언 타입부터 고급 구조를 위한 배열, 레인지(range), JSON/JSONB(반정형 데이터 저장), XML, Hstore(키-값 저장) 등 광범위한 데이터 타입 제공
- 높은 확장성과 프로그래밍 기능: 시스템을 사용자가 원하는 대로 확장 가능 (C언어나 PL/pgSQL로 사용자가 작성하여 데이터베이스에 추가 가능)
- 다양한 인덱싱 및 고성능 쿼리 처리
- 복제 및 확장성(Scalability)

<br/>
<br/>
<br/>
출처

- https://www.postgresql.org/
- https://mangkyu.tistory.com/71
- https://severalnines.com/blog/understanding-postgresql-architecture/#:~:text=Postmaster%20Process
